[
  {
    "No":"1",
    "Partner Name":"Abalimi Bezekhaya",
    "Province":"Western Cape",
    "Town":"Cape Town",
    "Address":"33, 2 Mobile Rd, Airport Industria, Cape Town, 7490",
    "About the project":"Abalimi Bezekhaya  means farmers of the home in isiXhosa and was in established 1982. Their projects support micro-farmers in the Cape Flats townships to address the consequences of high unemployment, to grow vegetables organically. Projects include home and community gardens, to encourage food security. They also support production gardens that generate an income for community members. Their vendor project provides support to local vendors who sell manure and seedlings within the community. They also support Early Childhood Development  centres and schools. Abalimi Bezekhaya implements the Growing Food for Life programme in the greater Cape Flats, namely: Khayelitsha, Nyanga, Gugulethu, Philippi, Browns Farm, Crossroads Delft and Mfuleni. ",
    "Latitude":"-33.922087",
    "Longitude":"18.4231418"
  },
  {
    "No":"2",
    "Partner Name":"Association for Rural Advancement (AFRA)",
    "Province":"KwaZulu-Natal",
    "Town":"Pietermarizburg",
    "Address":"123 Jabu Ndlovu Street, PMB",
    "About the project":"Association for Rural Advancement (AFRA) uses a participatory, context-sensitive methodology designed to meet the unique needs of women farmers in the uMgungundlovu District Municipality. Central to this approach is a community-centric design, where AFRA engages directly with women farmers to understand their challenges, such as limited access to resources, markets, and technical support, and to ensure the programme aligns with their lived experiences. The integration of indigenous farming practices and local knowledge are central. A gender lens underpins the entire approach, with a clear focus on women as primary actors and addressing systemic barriers to resource access and decision-making. The Association for Rural Advancement (AFRA) is a land rights advocacy non-governmental organisation working to support marginalised black people in rural areas, with a focus on farm dwellers, in and around the uMgungundlovu District Municipality in KwaZulu-Natal. \n",
    "Latitude":"-29.6015249",
    "Longitude":"30.3790245"
  },
  {
    "No":"3",
    "Partner Name":"Bloodriver Advice Office ",
    "Province":"Limpopo",
    "Town":"Seshego",
    "Address":"Blood River Village Lutheran Church Centre, 0751",
    "About the project":"Bloodriver Advice Office in Seshego, near Polokwane, has started vegetable gardening focusing on women in order to promote food security. They support program participants to feed themselves and their families and then sell the surplus vegetables to generate an income. They have been involved in resource mobilization in order to have a green space at their office which will eventually become a food garden which will contribute to the overall food security of the Blood River community. They have trained a group of local women on agroecology and permaculture principles. This has contributed to the wider community through donations of produce to vulnerable groups and selling produce at affordable rates to the rest of the community. The organisation identifies itself as a community based advice office that provides paralegal services including but not limited to human rights services, domestic violence interventions through victim empowerment services, promoting children’s rights & women’s rights, poverty alleviation, HIV\/AIDS awareness. ",
    "Latitude":"-23.8476768",
    "Longitude":"29.3932622"
  },
  {
    "No":"4",
    "Partner Name":"Sweetwaters Farm supported by Food & Trees for Africa",
    "Province":"Gauteng",
    "Town":"Walkerville",
    "Address":"Portion 73 Sweetwaters Street, Doornkuil, Walkerville, Gauteng (https:\/\/maps.app.goo.gl\/ReXLxKyTeiYnT65Y7)",
    "About the project":"Sweetwaters Farmers, in Walkerville, Johannesburg South, are supported by Food & Trees for Africa (FTFA) through its  capacity building support to micro farmers. Sweetwaters Farmers is a co-op with several members and Sweetwaters Farm is part of this co-op. They plant and grow dhania, spinach, cabbage, and onions on 8.5 hectares at Sweetwaters Farm. This provides access to nutritious food for community members and employment opportunities for their surrounding communities. This project allowed for infrastructure development and capacity-building for the Sweetwaters Farmers, who are micro farmers . The farmers received gardening tools, planting materials, educational materials and training workshops. These workshops equipped them with essential production skills, focusing on micro farm extension, permaculture principles, and soil fertility. This has resulted in the farmers having a flourishing micro farm that is enhancing food security and employment. With the increased activity at the farm, some of the seasonal workers became permanent employees. ",
    "Latitude":"-26.4241876",
    "Longitude":"27.9633039"
  },
  {
    "No":"5",
    "Partner Name":"Mopani Farmers Association (MFA) ",
    "Province":"Limpopo",
    "Town":"Giyani",
    "Address":"Stand no 39, Dhambi Village, Fourway Stop, Giyani",
    "About the project":"Mopani Farmers Association is in the Giyani area of Limpopo. They have successfully assisted groups of families to establish food gardens and produce nutritious food for improved and sustainable livelihoods using agroecology methods. The Mopani Farmers Association is a self-organised movement of small-scale farmers. It was established in response to the challenges faced by individual farmers working in isolation. Members recognised that approaching the Department of Agriculture as individuals was often ineffective, as support was typically granted to organised groups. The primary aim of the association is to advocate for support and address the needs of small-scale farmers. In addition, members share knowledge and build each other’s capacity, particularly in agroecological practices, offering mutual support and assistance.",
    "Latitude":"-23.3127019",
    "Longitude":"30.703424"
  },
  {
    "No":"6",
    "Partner Name":"My Dignity Restored Shelter for Abused Women and Children NPC ",
    "Province":"Free State",
    "Town":"Botshabelo",
    "Address":"1191\/2 Section W, Botshabelo, 9781",
    "About the project":"My Dignity Restored (MDR) Shelter for Abused Women and Children in Botshabelo, Free State, has gradually adopted the agroecology methodology, though it was not easy in the beginning since it looked like their vegetables were not getting as big as the ones where chemical fertilisers were being used. Since they started implementing the program, the results are evident, as they have managed to cultivate  80x80 square meters of land and get a good harvest despite the constraints of lack of water and very hot weather conditions. MDR was  formed to provide shelter to women and children who are survivors of abuse, to offer support to the survivors and to help them regain their sense of dignity and respect. ",
    "Latitude":"-29.2279544",
    "Longitude":"26.7059928"
  },
  {
    "No":"7",
    "Partner Name":"Neighbourhood Old Age Homes (NOAH)",
    "Province":"Western Cape",
    "Town":"Woodstock",
    "Address":"19 Regent Street, Woodstock, 7925",
    "About the project":"The NOAH community centres in Khayelitsha and Woodstock, Cape Town, are an integral part of the lives of social grant pensioners in the community. NOAH strengthens their members' knowledge, attitudes, values and skills thus enabling them to bring about the changes that the pensioners see as necessary to create a better life for themselves and their families. There are high levels of food insecurity amongst the elders and their families in these communities. Post-COVID, food security has been  made an organisational  priority, falling within its psycho-social support programme called NOAH Happiness. Their agroecology implementation involved a strategy to support food security initiatives, focusing on resource distribution and technical assistance. The plan was divided into two phases: summer and winter planting seasons. They have established a partnership with Abalimi Bezekhaya, which is responsible for procuring and distributing resources to NOAH in Khayelitsha. \n\n ",
    "Latitude":"-33.929413",
    "Longitude":"18.4497262"
  },
  {
    "No":"8",
    "Partner Name":"Oliver's House Education Centre",
    "Province":"Gauteng",
    "Town":"Benoni",
    "Address":"145 Malherbe Rd, Putfontein AH, Benoni, 1513",
    "About the project":"Oliver's House Education Centre is in Benoni, Gauteng, supporting Daveyton and surrounding areas. It has a long history of providing community support, not only through their vegetable gardens but also by offering educational opportunities to their agricultural students. This unique initiative is allowing their Level 4 agricultural students to apply everything they’ve learned about agriculture and business in their final year of study. The goal of this initiative is to empower students with the hands-on experience they need to successfully operate their own farms or sell fresh produce in a commercial setting. This venture is not just about growing vegetables. It is about learning useful and sustainable business management skills, and contributing to the community. The community garden is a pivotal part of their educational journey, offering them the opportunity to create something of lasting value that serves the local community while preparing them for the challenges of running their own agricultural businesses. Oliver's House Education Centre programmes include Early Childhood Development, computer literacy, agriculture training and a feeding-scheme which supports more than 600 beneficiaries per day.",
    "Latitude":"-26.1507068",
    "Longitude":"28.367639"
  },
  {
    "No":"9",
    "Partner Name":"Railton Foundation Swellendam ",
    "Province":"Western Cape",
    "Town":"Swellendam",
    "Address":"St. Patrick’s Catholic Church, 31 Veldkornet Street, Swellendam, 6740",
    "About the project":"Railton Foundation is supporting the residents of the Railton Township in Swellendam, Western Cape. Some of the social challenges are poverty, food insecurity, Gender based violence (GBV), alcohol or substance abuse and unemployment. The community garden changed from being just a garden to becoming a resource centre for training and growing seedlings. he foundation aims to foster integrated community development, working with South African authorities, organisations, and structures. The foundation has supported a range of projects, including an agroecology and food distribution program. ",
    "Latitude":"-34.0275079",
    "Longitude":"20.4436269"
  },
  {
    "No":"10",
    "Partner Name":"Seriti Institute (implementing in Deelpan, North West)",
    "Province":"North West",
    "Town":"Deelpan",
    "Address":"https:\/\/maps.app.goo.gl\/Fgxcb3deoLNiCYjF6",
    "About the project":"This flagship Multifunctional Agri-node (MFAN)  in Deelpan village in the North-West is supported by the Seriti Institute. The selection of the area was based on the accessibility, market potential, and support for local agri-businesses. This node is strategically located near the main road to serve as a central hub for production, sales and training. Seriti works with their social partners and community champions to create work opportunities, alleviate poverty and inequality by nurturing stronger, food-secure, and resilient communities. ",
    "Latitude":"-26.3332921",
    "Longitude":"25.588931"
  },
  {
    "No":"11",
    "Partner Name":"Sustainable Community Development",
    "Province":"Free State",
    "Town":"Rosendal",
    "Address":"Waaipoort Farm, Box 11, Rosendal, 9720",
    "About the project":"Sustainable Community Development (SCD) in Rosendal, Free State, has developed a demonstration garden at Waaipoort Farm and has taken the learning to their participants' individual home gardens in Mautse. From small beginnings in 2002, SCD is now leading a way towards ethical, resilient and sustainable human settlements, practicing permaculture and regenerative agriculture. ",
    "Latitude":"-28.5075715",
    "Longitude":"27.9253608"
  },
  {
    "No":"12",
    "Partner Name":"Terrestrial Kulture",
    "Province":"Eastern Cape",
    "Town":"Misty Mount",
    "Address":"Misty Mount Location, Corana AA, Libode, Eastern Cape, 5160",
    "About the project":"Terrestrial Kulture is in Misty Mount, Eastern Cape, and is helping to address local food security through training 25 community members in worm farming, organic pesticide production and composting. They have also educated community members, students and teachers from three cooperatives about tree planting and its significance. A significant focus is placed on educating school children and supporting women, as these groups are pivotal for the continuity and resilience of these practices. They offer ongoing practical training sessions at Ngxanga and Maqhukwana schools on raised bed construction, composting, pest control, soil health, and water harvesting techniques. They are also conducting poultry training in partnership with Sydney Consult and are training 15 farmers on indigenous chicken, pastured poultry, and biodiversity with market access support that is provided post-training. All of this aims to nurture a community that can thrive independently and address social challenges with strength and confidence.",
    "Latitude":"-31.5363215",
    "Longitude":"28.9481109"
  },
  {
    "No":"13",
    "Partner Name":"Thanda After-School NPC",
    "Province":"KwaZulu-Natal",
    "Town":"Hibberdene",
    "Address":"801 Bradfield Road, Woodgrange, Hibberdene, KZN",
    "About the project":"Thanda After-School (Thanda) works throughout the Umzumbe Municipality in the Ugu District of rural KwaZulu-Natal. In this project, Thanda has enhanced its existing irrigation systems at the communal farms and improved existing quality control methods for seedling delivery within their farm operations. They targeted the most pressing needs thereby localising the goals of the programme within their own ongoing initiative, which is centred around enabling smallholder farmers to successfully grow food in their communities. Thanda was established in 2008 to provide critically needed support for children through After-School Programmes. Over the years, Thanda has evolved to offer hyper-local, holistic solutions that support all children and families.  ",
    "Latitude":"-30.61076439999999",
    "Longitude":"30.5358849"
  },
  {
    "No":"14",
    "Partner Name":"Tlou Tlou Youth Development",
    "Province":"Limpopo",
    "Town":"Polokwane",
    "Address":"2074 Mokgao, Park St, Mmotong, Polokwane, 0742",
    "About the project":"Tlou Tlou Youth Development is in Mmotong, Polokwane, Limpopo and it's main goal is to improve food security in the community, mainly working with youth and women. This helps many households to eat healthy and safe food and avoid hunger or malnutrition whilst also creating job opportunities. Tlou Tlou believes that food sovereignty addresses the root causes of household and community hunger and also supports the local community with job opportunities.",
    "Latitude":"-23.8980905",
    "Longitude":"29.4499945"
  },
  {
    "No":"15",
    "Partner Name":"Wana Johnson Learning Centre",
    "Province":"Eastern Cape",
    "Town":"Vlei Administration Area",
    "Address":"Ward 26, Taweni Location , Vlei Administration Area, Holy Cross, 4811",
    "About the project":" Wana Johnson Learning Centre runs an Early Childhood Development (ECD) centre in Holy Cross, Eastern Cape. They have a demonstration garden on the project site and offer homework support to local learners. They cook lunch for the ECD learners using the fresh produce that they grow. They also supply surrounding schools with surplus. The women who work on the agroecology project don't pay for their children to access the centre's services. Project partners or beneficiaries also sew, crochet and have home gardens. They share produce amongst each other when the yield is low because of recent climate change-related challenges. The organisation is intentionally preserving indigenous knowledge by incorporating it with agroecology principles.They work very closely with the traditional council and attribute their success to their community-centric approach. They have implemented water solutions in their village and a surrounding comunity through organising community members to contribute their manual labour to install the materials purchased through fundraising. ",
    "Latitude":"-32.2968402",
    "Longitude":"26.419389"
  },
  {
    "No":"16",
    "Partner Name":"Woza Moya Community Development ",
    "Province":"KwaZulu-Natal",
    "Town":"Ixopo",
    "Address":"District Road D64 Chibini Village, Ixopo, 3276, South Africa",
    "About the project":"Woza Moya Community Development works in the Ufafa valley, Ixopo, KZN. They support food security for vulnerable families while building strong connections through gardening. Beyond food, the project has created economic opportunities, improved health, empowered women and fostered community bonds. By promoting sustainable practices, the organisation and the programme participants are also protecting the environment and preserving cultural traditions. Post-Covid, families are continuing to report food shortages. People have lost jobs, some family members are migrating from cities and towns where they once had jobs to stay with their families in Ufafa valley. With food prices constantly increasing, Woza Moya has distributed more than 2000 food parcels to needy families thus far. They have developed a more long term sustainable solution to food security issues through growing food in home and communal gardens.",
    "Latitude":"-30.157441",
    "Longitude":"30.0647665"
  },
  {
    "No":"17",
    "Partner Name":"Zululand Conservation Trust ",
    "Province":"KwaZulu-Natal",
    "Town":"Mkuze",
    "Address":"Manyoni Private Game Reserve, Poincare Farm, Mkuze, KwaZulu-Natal, 3965",
    "About the project":"One angle of the Zululand Conservation Trust's (ZCT) work is to work closely with local leaders to support community initiatives in the KwaMandlakazi region of Mkhuze, northern KZN. This project has a main garden based in the ECD centre. They use it for their practical training as well as to support meals for learners. The programme provides tailored mentoring based on the beneficiaries’ preferred work styles. This approach includes tailored individual learning, monthly mentorship sessions and collective monthly mentoring sessions. They focus on regenerating the soil’s nutritional status, sustainable land care practice and garden management practices because their participating communities grapple with environmental degradation due to previously practicing unsustainable farming practices.  Zululand Conservation Trust's (ZCT) work focuses on the conservation of wildlife species threatened with extinction however a large aspect of what they do focuses on water and nutrition provision; skills development and providing Early Childhood Development (ECD) access  to the communities adjacent to their wildlife areas. \n",
    "Latitude":"-27.6208718",
    "Longitude":"32.0334793"
  },
  {
    "No":"18",
    "Partner Name":"Ingomuso Lethu Centre",
    "Province":"Mpumalanga",
    "Town":"Verena",
    "Address":"Stand No 1580, Verena D Vezi, Verena, 0458 ",
    "About the project":"Ingomuso Lethu Centre (ILC) is in Verena D, Mpumalanga, and is dedicated to addressing socio-economic rights and human rights education within the community. In a recent expansion of its holistic approach, Ingomuso Lethu Centre has introduced a food-growing initiative aimed at supporting GBV survivors. This programme not only addresses food insecurity but also equips survivors with practical agricultural skills. Some participants are now learning to grow their own food, helping to restore their independence, build resilience and foster a sense of purpose and empowerment in the aftermath of trauma. Founded in 2016, ILC was established as a self-help facility in response to the lack of meaningful development and the challenges faced by disadvantaged members of the Verena community. The organisation focuses on combating gender-based violence (GBV), empowering women, and providing free paralegal advice services. ILC actively works with local stakeholders, including civil society, police and social services, to create a safer, more supportive environment for women and children. \n",
    "Latitude":"-25.480777",
    "Longitude":"29.0164647"
  },
  {
    "No":"19",
    "Partner Name":"Letlhabile Network Community Advice Office ",
    "Province":"North West",
    "Town":"Lethlabile-G (Brits)",
    "Address":"268 Block G, Lethlabile-G, Brits, 0264 ",
    "About the project":"Letlhabile Network Community Advice Office is in Letlhabile, Brits, North West. In addition to its access to justice support through paralegal services, mediation, referral, psychosocial support, they also have a recently added shelter for survivors of GBV,  GBV Help Desk, and have recently expanded their support to include food security initiatives. Recognising the importance of holistic recovery and self-reliance, the organisation has introduced a food-growing project aimed at supporting victims of GBV. Some survivors are now actively gaining skills in sustainable food production and are being empowered to grow their own food, a crucial step toward restoring dignity, independence, and long-term well-being.",
    "Latitude":"-25.4625117",
    "Longitude":"27.8326081"
  },
  {
    "No":"20",
    "Partner Name":" Nkuzi Development Association (Supporting Batho Golang NPC)",
    "Province":"Limpopo",
    "Town":"Moremadi",
    "Address":"https:\/\/maps.app.goo.gl\/Q5Xm4eofTTvP2uMZ9",
    "About the project":"Batho Golan is in Moremadi, LImpopo, supported by Nkuzi Development Association, working to promote food security by establishing home gardens. Participants feed their families and donate the surplus of the produce to community members who are less privileged, including the elderly. The programme focuses on the replication of the food gardens in local schools for augmentation of the feeding scheme. They have expanded to cover environmental issues by recycling, reusing and reducing waste in order to create job opportunities for some project members. They are improving the lives of community members by helping to reduce poverty, fight hunger and support youth as well as women against unemployment through developmental programmes and business opportunities. Nkuzi Development Association was established in 1997 and has supported land claims processes since then, assisting with claim forms, facilitation of land claims committees and documentation of supporting evidence for the land claims to ensure that claims are lodged timeously.",
    "Latitude":"-23.4012946",
    "Longitude":"29.4179324"
  }
]