[
  {
    "No":"1",
    "Apartheid Crime":"Cradock 4 Murders",
    "Province":"Eastern Cape",
    "Place of apartheid crime":"Gqeberha",
    "Case description ":"On 27 June 1985, four anti-apartheid community activists, Fort Calata, Matthew Goniwe, Sicelo Mhlauli, and Sparrow Mkonto, collectively known as the \"Cradock Four,\" were arrested at a roadblock set up by the Security Branch of the South African Police, assaulted and murdered near then Port Elizabeth. They were on their way back to Cradock. Two inquests were held in 1987 and 1993, respectively, but no one was ever prosecuted for the murders, despite the findings of the 1993 inquest. Prolonged delays led to most of the suspects passing away, and hopes for prosecution faded further when the last key suspect died in mid-2023. In early 2024, a third inquest was formally reopened. This inquest resumed in the Gqeberha High Court from 2 to 11 June 2025, focusing on testimony from the victims’ families and their witnesses. Testimony from former state officials, including van der Westhuizen, is currently scheduled to take place from 13 to 24 October 2025.",
    "Stage of the proceedings":"[Re-opened inquest ongoing] Third re-opened inquest is on-going and will continue at the Gqeberha High Court from 13 to 24 October 2025. ",
    "TRC":"In 1996, the families testified before the TRC, and in 1999, six former security officers were denied amnesty. ",
    "Latitude":"-33.91369299999999",
    "Longitude":"25.5826876"
  },
  {
    "No":"2",
    "Apartheid Crime":"PEBCO 3 Murders",
    "Province":"Eastern Cape",
    "Place of apartheid crime":"Cradock",
    "Case description ":"On 8 May 1985, three anti-apartheid activists, Sipho Charles Hashe, Qaqawuli Godolozi, and Champion Galela, collectively known as the \"PEBCO Three\" were abducted by members of the Security Branch at Port Elizabeth Airport and subsequently murdered near Cradock (now Nxuba) on a farm known as Post Chalmers, in the Eastern Cape. In July 2025, the NPA announced that the Minister of Justice approved the opening of the inquest before the Gqeberha High Court.",
    "Stage of the proceedings":"[Inquest opened]",
    "TRC":"The TRC granted amnesty to two individuals for the abduction and murder, however, other perpetrators implicated in the case were refused amnesty.",
    "Latitude":"-32.1745255",
    "Longitude":"25.6332919"
  },
  {
    "No":"3",
    "Apartheid Crime":"Caiphus Nyoka",
    "Province":"Gauteng",
    "Place of apartheid crime":"Daveyton",
    "Case description ":"On 24 August 1987, student activist Caiphus Nyoka was shot dead at his home in Daveyton by members of the police. The officers claimed self-defence, stating they had fired nine shots, but a family's pathologist revealed twelve bullet wounds on Nyoka’s body. On 20 March 2023, the State Attorney filed charges against three individuals for the murder of Caiphus Nyoka, followed by charges against a fourth accused in 2024. After multiple delays, the trial eventually began in 2022. In a significant development, one of the accused, Johan Marais, confessed to the murder and pleaded guilty on 12 November 2024. On the 10th of July 2025 he was sentenced to 15 years in prison. The trial against the remaining three accused is scheduled to resume in September.",
    "Stage of the proceedings":"[Trial] Trial of three accused is on-going and will continue from 8 to 19 September 2025. ",
    "TRC":"In 1997, Nyoka’s sister, Alegria, testified before the TRC but none of the police officers involved in Caiphus' killing applied for amnesty. ",
    "Latitude":"-26.1452452",
    "Longitude":"28.4221519"
  },
  {
    "No":"4",
    "Apartheid Crime":"COSAS 4 Murders",
    "Province":"Gauteng",
    "Place of apartheid crime":"Krugersdorp",
    "Case description ":"On 15 February 1982, four Congress of South African Students (COSAS) activists: Eustice \"Bimbo\" Madikela, Ntshingo Matabane, Fanyana Nhlapo, and Zandisile Musi, were targeted in a Security Branch operation in a pump house near Krugersdorp. Madikela, Matabane, and Nhlapo were killed in the explosion, while Musi was seriously injured. The incident was orchestrated to give the false impression that the men had accidentally blown themselves up during military training. Thlomedi Ephraim Mfalapitsa and Christiaan Siebert Rorich were charged with kidnapping and murder in 2021, with additional charges of crimes against humanity added later. Despite delays in their trial, a landmark ruling by Judge Dosio in April 2025 confirmed that the two men can be prosecuted for crimes against humanity before South African courts.",
    "Stage of the proceedings":"[Trial] - The commencement of the trial has been delayed multiple times.",
    "TRC":"The TRC denied amnesty to several perpetrators, and Joe Mamasela, who drove the security police to the mine pump house, never applied for amnesty. ",
    "Latitude":"-26.0790652",
    "Longitude":"27.7742269"
  },
  {
    "No":"5",
    "Apartheid Crime":"Highgate Massacre",
    "Province":"Eastern Cape",
    "Place of apartheid crime":"East London",
    "Case description ":"On 1 May 1993, masked gunmen attacked the Highgate Hotel outside East London using automatic rifles and hand grenades. On that day, Deric Whitfield, Stan Hacking, Deon Wayne Harris, Dave Wheeler, and Douglas Gates were killed, and seven others were injured including Neville Beling, Karl Weber, Billy Baling, Megan Boucher, and Charles Bodington as well as Nkosinathi Alfred Gontshi and Doreen Roussouw who have since passed away. Following years of advocacy efforts, tireless fight for justice and renewed investigation, in April 2024, the NPA decided to open an inquest into the Highgate Massacre, which is ongoing.",
    "Stage of the proceedings":"[Inquest ongoing] The inquest will continue from 11 to 15 August 2025 at the East London Special Tribunal. ",
    "TRC":"Despite testimony from survivors and family members before the TRC’s Human Rights Violations Committee in 1996 and 1997, no one has ever applied for amnesty.",
    "Latitude":"-33.0194318",
    "Longitude":"27.9054471"
  },
  {
    "No":"6",
    "Apartheid Crime":"Ramatha Nicholas ‘Boiki’ Tlhapi",
    "Province":"North West ",
    "Place of apartheid crime":"Stilfontein ",
    "Case description ":"On 20 March 1986, Ramatha Nicholas \"Boiki\" Tlhapi, aged 21, was arrested by the South African Police while traveling to a funeral of several comrades in Stilfontein. Thlapi was last seen lying motionless in his cell, bleeding from the nose and mouth. After the arrest, Tlhapi disappeared, and despite the family's efforts, neither he nor his remains were ever found. Despite obtaining several statements from Boiki’s friends and police officers during an inquest in 1994, the magistrate concluded that there was insufficient evidence to determine whether Boiki was deceased. Following recommendations from the NPA, the Minister of Justice and Constitutional Development approved the reopening of the inquest into Tlhapi’s disappearance in November 2024. ",
    "Stage of the proceedings":"[Re-opened inquest - dates to be set]",
    "TRC":"In 1996, Tlhapi’s father, Barileng Tlhapi, testified before the TRC, none of the police officers had applied for amnesty, ",
    "Latitude":"-26.844756",
    "Longitude":"26.7655586"
  },
  {
    "No":"7",
    "Apartheid Crime":"Ignatius ‘Iggy’ Mthebule ",
    "Province":"Gauteng",
    "Place of apartheid crime":"Johannesburg",
    "Case description ":"In 1987, student activist  and MK operative Ignatius \"Iggy\" Mthebule's unit was allegedly infiltrated by an apartheid agent Joy Harden. It is believed that Harden identified Iggy to the members of the Security Branch at the restaurant in Hillbrow, where he was last seen alive. His whereabouts remain unknown. The Hakws are investigating the matter.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"Iggy’s brother, Samuel Mthebule, testified about Iggy’s disappearance but the TRC was unable to determine what happened to Mthebule. No one applied for amnesty for Iggy's disappearance.",
    "Latitude":"-26.205647",
    "Longitude":"28.0337185"
  },
  {
    "No":"8",
    "Apartheid Crime":"Matthews Mabelane",
    "Province":"Gauteng",
    "Place of apartheid crime":"John Vorster Square",
    "Case description ":"On 16 February 1977, Matthews Mabelane, a young anti-apartheid activist, died after falling from a 10th-floor window during interrogation at John Vorster Square by the Security Branch. Mabelane was detained for 25 days following his arrest while attempting to leave South Africa for Botswana. A 1977 inquest later found the death accidental - a verdict that was not accepted by the family. In August 2024, the legal team representing the Mabelane family formally requested that the NPA reopen the inquest into Matthews Mabelane’s brutal death. The Minister of Justice approved the reopening of the inquest in February 2025.",
    "Stage of the proceedings":"[Re-opened inquest - dates to be set]",
    "TRC":"Matthews’s father, Reverend Phillip Mabelane, testified before the TRC. However, none of the police officers implicated in his death applied for amnesty. ",
    "Latitude":"-26.19611032137056",
    "Longitude":"28.03897863450159"
  },
  {
    "No":"9",
    "Apartheid Crime":"Ntombikayise Kubheka ",
    "Province":"KwaZulu-Natal",
    "Place of apartheid crime":"Winklespruit",
    "Case description ":"In 1987, Ntombikayise Kubheka, an MK operative and ANC member, was kidnapped by the Port Natal Security Branch after being lured to the Durban Beachfront by askaris. It  is alleged she was interrogated and tortured at the Winkelspruit Army Shooting Range and allegedly died during the interrogation. In October 2022, the NPA initially decided to open an inquest into her murder. However, by December 2023, it had opted instead to pursue criminal charges against former Security Branch members for her kidnapping and murder. Since then, two of the accused have passed away, and the trial has faced repeated delays.",
    "Stage of the proceedings":"[Trial] The commencement of the trial has been repeatedly delayed due to the SAPS’s refusal to cover the legal costs of the accused.",
    "TRC":" Several individuals involved in Kubheka abduction applied for amnesty, but four were denied.",
    "Latitude":"-30.1046546",
    "Longitude":"30.8527655"
  },
  {
    "No":"10",
    "Apartheid Crime":"Nokuthula Simelane",
    "Province":"Limpopo",
    "Place of apartheid crime":"Northam",
    "Case description ":"In 1983, Nokuthula Simelane, an underground Umkhonto weSizwe (MK) courier, was abducted at the Carlton Centre in Johannesburg, brutally tortured at the Custodum Flats in Norwood and a farm at Northam in the former Northern Transvaal, and forcibly disappeared. The whereabouts of her body remain unknown. Following a court application filed by the family against the NPA and SAPS in 2015, four former Security Branch officers were charged with her murder in 2016. Since then, two of the accused have passed away.  In 2019, the court formally declared Nokuthula dead. The commencement of the trial of the two remaining accused faces repeated delays — initially due to disputes over legal costs, and later due to a claim by one of the accused that he was unfit to stand trial.",
    "Stage of the proceedings":"[Trial] The commencement of the trial has been delayed after one of the accused claimed he was unfit to stand trial.",
    "TRC":"Some former members of the security branch applied for and were granted amnesty for her torture, but others were denied amnesty because they had failed to “make a full disclosure of relevant facts.” No one applied for amnesty for Nokuthula's murder. ",
    "Latitude":"-24.9562483",
    "Longitude":"27.2610051"
  },
  {
    "No":"11",
    "Apartheid Crime":"Ahmed Timol",
    "Province":"Gauteng",
    "Place of apartheid crime":"John Vorster Square",
    "Case description ":"On 22 October 1971, the anti-apartheid activist and a member of the South African Communist Party, Ahmed Timol and his fellow activist Salim Essop were arrested at a roadblock and found with banned political literature. Following fives days of brutal interrogation and torture at the notorius John Vorster Square in Johannesburg, Timol died in police custody on 27 October 1971. The police claimed he had jumped of the 10th floor. Decades later, following the persistent efforts of Timol’s family, a historic second inquest in 2017 overturned the original finding of suicide. The court concluded that Timol had been tortured and murdered by members of the Security Branch. In 2018, Joao Rodrigues was charged with Timol’s murder, but he died before standing trial.",
    "Stage of the proceedings":"[Re-opened inquest concluded] ",
    "TRC":"The Timol's mother, Hawa testified before the TRC but none of the perpetrators applied for amnesty. ",
    "Latitude":"-26.20761519579212",
    "Longitude":"28.02664575056103"
  },
  {
    "No":"12",
    "Apartheid Crime":"Hoosen Mia Haffejee",
    "Province":"KwaZulu-Natal",
    "Place of apartheid crime":"Durban",
    "Case description ":"On 2 August 1977, Dr. Hoosen Mia Haffejee, a 26-year-old dentist, died in police custody at Durban's Brighton Beach police station. Police alleged he committed suicide by hanging. However, an independent expert highlighted inconsistencies regarding the approximately 60 wounds found on his body. An inquest into Haffejee’s death was held in 1978 and ruled his death a suicide. Following pressure from the family, on 16 August 2019, the NPA announced the reopening of the inquest. Haffejee’s last surviving interrogator James Taylor died just three days later, leaving none of the main alleged perpetrators alive. In 2023, the judgement overturned the findings of the original inquest, finding that members of the security branch had been responsible for Haffejee’s death in detention.   ",
    "Stage of the proceedings":"[Re-opened inquest concluded] ",
    "TRC":"Only one person applied for amnesty for their involvement in the Haffejee's death but was denied. ",
    "Latitude":"-29.85260448094786",
    "Longitude":"31.0266781834182"
  },
  {
    "No":"13",
    "Apartheid Crime":"Abdullah Haron",
    "Province":"Western Cape",
    "Place of apartheid crime":"Cape Town",
    "Case description ":"On 27 September 1969, Imam Abdullah Haron, who had been detained on May 28, 1969, on terrorism charges, died in police custody after 123 days of solitary confinement and daily interrogations. An initial inquest in 1970 ruled his death as accidental, despite contradictory evidence. In December 2019, the Haron family submitted new evidence to the NPA, seeking to reopen the inquest into Imam Haron’s death. In 2023, the inquest judge confirmed the Haron family’s belief that the Imam had died from torture-related injuries, not a fall. ",
    "Stage of the proceedings":"[Re-opened inquest concluded] ",
    "TRC":"While the TRC did investigate his death, the perpetrators did not come forward to seek amnesty for their actions.",
    "Latitude":"-33.92342277157874",
    "Longitude":"18.41439818203678"
  },
  {
    "No":"14",
    "Apartheid Crime":"Dr Neil Hudson Aggett",
    "Province":"Gauteng",
    "Place of apartheid crime":"John Vorster Square",
    "Case description ":"On 5 February 1982, Dr. Neil Aggett was found dead, hanging in his cell at John Vorster Square after 70 days in police custody. Although the initial inquest ruled his death a suicide, there was clear evidence that Aggett had been tortured while in detention. In 2016, the Aggett family requested the NPA to reopen the inquest into his death, which only proceeded in 2019 after they threatened legal action. In 2022, Judge Makume overturned the original findings, ruling that Aggett died as a result of foul play by the Security Branch. The court recommended further investigation and possible prosecutions, but the NPA has yet to lay charges. The key suspect died in 2023.",
    "Stage of the proceedings":"[Re-opened inquest concluded] ",
    "TRC":"While the TRC investigated the case, none of the perpetrators applied for amnesty.",
    "Latitude":"-26.19701598060724",
    "Longitude":"28.0255973930555"
  },
  {
    "No":"15",
    "Apartheid Crime":"Musawenkosi \"Sbo\" Phewa",
    "Province":"KwaZulu-Natal",
    "Place of apartheid crime":"Unknown",
    "Case description ":"Sbho Phewa was an anti-apartheid activist, a member of the United Democratic Front (UDF) and an underground MK operative. Sbho had ties with Ntombi Kubheka who ran the ANC Cell in KwaMashu, KwaZulu Natal. TRC records show that Ntombi sought help from askaris she believed were her MK comrades to assist Phewa in collecting firearms from Transkei. Unbeknownst to her, this request would ultimately lead to Phewa’s disappearance. It is believed that Phewa was abducted by the Security Branch in 1987. Phewa was never seen again. In October 2022, the NPA initially decided to open an inquest into his murder. However, by December 2023, it had opted instead to pursue criminal charges against former Security Branch members for his kidnapping and murder. Since then, two of the accused have passed away, and the trial has faced repeated delays.",
    "Stage of the proceedings":"[Trial] The commencement of the trial has been repeatedly delayed due to the SAPS’s refusal to cover the legal costs of the accused.",
    "TRC":"No-one has ever applied for amnesty for the disappearance of Sbo Phewa. ",
    "Latitude":"-28.5305539",
    "Longitude":"30.8958242"
  },
  {
    "No":"16",
    "Apartheid Crime":"Richard and Busisiwe Irene Motasi",
    "Province":"Gauteng",
    "Place of apartheid crime":"Hammanskraal",
    "Case description ":"Richard Motasi was a policeman based at the Hammanskraal Police College. The Northern Transvaal Security Police suspected him of being an ANC agent and leaking sensitive information to ANC operatives in Zimbabwe and Johannesburg. Richard and Busisiwe were shot dead by the Security Branch on 1 December 1987 at the family’s Hammanskraal home in the presence of their five-year old son, Tshidiso. Although an initial inquest was held, its findings are unavailable. The Hawks' investigation into the deaths of Richard and Irene Motasi remains ongoing.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"Some of the perpetrators applied for amnesty, claiming they believed Motasi was working with the ANC. Others never applied. Two were granted amnesty for both murders, while the other two received amnesty for Richard’s murder but not for Busisiwe’s.",
    "Latitude":"-25.4131348",
    "Longitude":"28.2579513"
  },
  {
    "No":"17",
    "Apartheid Crime":"Anton Fransch",
    "Province":"Western Cape",
    "Place of apartheid crime":" Athlone",
    "Case description ":"On 17 November 1989, 20-year-old Anton Fransch, a COSAS member and MK commander, was killed in Cape Town. He died after a seven-hour siege (referred to as \"the Battle of Athlone\") at the hands of the South African Police and the South African Defence Force, who targeted him for his anti-apartheid activities. Anton’s mother, died in 2024 without seeing even a glimmer of justice. In March 2025, the Fransch family made representations to the NPA requesting the re-opening of an inquest into his death. The formal decision is pending.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"While Anton's brother Marc testified before the TRC hoping to find out the truth, no one applied for amnesty for Marc’s alleged murder. ",
    "Latitude":"-33.95825679555264",
    "Longitude":"18.50838717757813"
  },
  {
    "No":"18",
    "Apartheid Crime":"Bayempini Mzizi",
    "Province":"KwaZulu-Natal",
    "Place of apartheid crime":"Durban",
    "Case description ":"Bayempini Mzizi was a traditional healer who was sometimes approached by members of MK before and after their operations. On 9 July 1977, Mzizi was arrested on suspicion of terrorism and detained without trial. He was held for more than 35 days at the Brighton Beach Police Station. On 13 August, he was found hanging in his cell—just ten days after the suspicious death of another political detainee, Dr Hoosen Haffejee, in the same facility and under eerily similar circumstances. In 1978, a magistrate during the first inquest concluded that Mzizi had died by suicide and held no one accountable for his death. The family has never accepted this verdict. In February 2021, lawyers for Mzizi’s son asked the NPA to reopen the inquest into his death but to date, no formal decision has been made, with the NPA and Hawks citing an ongoing investigation.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"No-one applied for amnesty into the Mzizi's death. ",
    "Latitude":"-29.85578814721454",
    "Longitude":"31.03078865566874"
  },
  {
    "No":"19",
    "Apartheid Crime":"Storey “Luke” Mazwembe",
    "Province":"Western Cape",
    "Place of apartheid crime":"Cape Town",
    "Case description ":"On 2 September 1976, Luke Mazwembe, a member of the Western Province Workers' Advice Bureau and the South African Students' Association, was detained. He was reported dead just two hours later, found in his cell at Caledon Square Police Station in Cape Town. During the 1976 inquest into his death, police denied assaulting Mazwembe. However, state pathologist reported multiple injuries on Mazwembe’s body, including bruises, abrasions, and swelling. Nonetheless, the magistrate ruled that Mazwembe had not been tortured or assaulted in custody. The Hawks are investigating the matter.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"The family approached the TRC but no-one has ever applied for amnesty for Mazwembe's death. ",
    "Latitude":"-33.91991350184752",
    "Longitude":"18.42486354465139"
  },
  {
    "No":"20",
    "Apartheid Crime":"Ashley Kriel",
    "Province":"Western Cape",
    "Place of apartheid crime":"Athlone",
    "Case description ":"Ashley Kriel was a young anti-apartheid activist from Bonteheuwel. Due to his political activism, Kriel was placed under surveillance by the Security Branch. As a result, he went underground, joined MK and went into exile to receive military training abroad. Shortly after returning to South Africa, his cover was compromised. On 9 July 1987, 19-year-old Kriel answered the door to his room, thinking that the men outside were municipal workers. He was shot and killed by members of the South African Police in in Hazendal, Athlone, Cape Town. The initial inquest held in 1989 found that the police was not legally liable for Ashley’s death. The Hawks are investigating the matter.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"The only perpetrator who applied for amnesty before the TRC for his role in Kriel's killing was granted amnesty and died in 2024.",
    "Latitude":"-33.97349727585551",
    "Longitude":"18.50631607544738"
  },
  {
    "No":"21",
    "Apartheid Crime":"Mlungisi Wellington Tshazibane",
    "Province":"Gauteng",
    "Place of apartheid crime":"John Vorster Square",
    "Case description ":"Mlungisi Tshazibane was born and raised in Soweto and went on to study engineering at the University of Fort Hare and later at Oxford University. In1976, he was arrested under the Terrorism Act for his alleged involvement in the Carlton Centre explosion. On the 11th of December, 30-year-old Tshazibane was found hanging at the notorious John Vorster Square police station. A 1977 inquest concluded that Tshazibane’s death was consistent with suicide by hanging. The verdict has never been accepted by the family, who believe that Tshazibane was killed. The Hawks are investigating the matter.  ",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"The family approached the TRC for assistance but none of the perpetrators applied for amnesty. ",
    "Latitude":"-26.20291624192704",
    "Longitude":"28.03125767117453"
  },
  {
    "No":"22",
    "Apartheid Crime":"Clare Stewart",
    "Province":"KwaZulu-Natal",
    "Place of apartheid crime":"Ingwavuma",
    "Case description ":"On 24 November 1993, Clare Stewart, the 34-year-old MK operative and rural community activist and development worker had been abducted, her hands tied, and then shot in the head. Her body was discovered by cattle herders in a shallow ditch in Ingwavuma, in KwaZulu Natal. Before her disappearance, she had asked her sister Rachel to care for her children should anything happen to her—an acknowledgement of the risks she faced as an MK operative.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"While the TRC conducted an investigation into Clare's murder, no-one ever applied for amnesty. ",
    "Latitude":"-27.1346659",
    "Longitude":"31.9960398"
  },
  {
    "No":"23",
    "Apartheid Crime":"Dr Richard “Rick” Turner",
    "Province":"KwaZulu-Natal",
    "Place of apartheid crime":"Durban",
    "Case description ":"Dr. Richard “Rick” Turner was a prominent anti-apartheid academic. In Durban, Turner met Steve Biko and became a key figure in the 'Durban Moment,' promoting Black Consciousness, trade unionism, and broader resistance to apartheid. Banned in 1973 for his activism, he was frequently harassed by the Security Branch. On 8 January 1978, Turner was murdered. He was shot through the window of his Bellair home in Durban, dying in his 13-year-old daughter's arms. An informal inquest held in 1978 concluded that Turner had been killed by “unknown persons.” No one has ever been held accountable, although the Security Branch is widely believed to be responsible. Following new evidence presented during the reopened Haffejee inquest, the NPA informed the family in 2024 that the inquest would be reopened. However, a formal decision is still pending, and forty-seven years later, the Hawks-led investigation remains ongoing.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"In 1996, the Turner family testified before the TRC, hoping that the perpetrators would come forward and apply for amnesty. No-one did. ",
    "Latitude":"-29.85518064658501",
    "Longitude":"31.02830522362622"
  },
  {
    "No":"24",
    "Apartheid Crime":"Mxolisi ‘Dicky’ Jacobs",
    "Province":"Northern Cape",
    "Place of apartheid crime":"Upington",
    "Case description ":"On October 22, 1986, Mxolisi Dicky Jacobs, a founder of the Upington Student Congress and UDF activist, was found dead, hanging in his cell at Upington Prison. He was arrested on June 12, 1986, by the Security Branch and held for 129 days, during which he was allegedly tortured. Fellow detainees found it unlikely he had committed suicide, as he was reportedly in good spirits prior to his death. The 1987 inquest was marred with inconsistencies. Although Dicky’s case is still under investigation, with many records missing or destroyed, the family remains hopeful that they will one day find some measure of closure.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"Dicky’s mother, grandfather and two aunts made statements to the TRC but no-one applied for amnesty. ",
    "Latitude":"-28.450844",
    "Longitude":"21.2467565"
  },
  {
    "No":"25",
    "Apartheid Crime":"Bathandwa Ndondo",
    "Province":"Eastern Cape",
    "Place of apartheid crime":"Cala",
    "Case description ":"Bathandwa Ndondo was an MK underground cadre and dedicated student activist from the University of Transkei. On 24 September 1985, Ndondo was abducted from his home in Cala by men in a minibus. He was seen trying to escape and shouting for help before being shot and killed in a neighbour’s yard. The attack was carried out by Transkei Security Branch members and askaris from Vlakplaas. The trial into his death collapsed due to non-cooperation from the security forces. Six of Ndondo’s associates and potential witnesses were banished to remote parts of Transkei following his killing. The Hawks are investigating the matter.",
    "Stage of the proceedings":"[On-going investigation]",
    "TRC":"In April 2000, the TRC granted two individuals amnesty for their roles in Ndondo’s killing.",
    "Latitude":"-31.5269808",
    "Longitude":"27.6937236"
  }
]